#+TITLE: Daily Coding Problem #1
#+PROPERTY: header-args:python :session *python* :cache no :results output :exports both :tangle yes

*** lists in python
#+begin_src python :results output
import time
lst = [10, 15, 3, 7]
k = 18
print(lst)
print(k)

def f1(lst, k):
    o = []
    for i in lst:
        for j in lst:
            o.append((i + j) is k)
    return(sum(o) > 0)

tic = time.perf_counter()
print(f1(range(1000), k))
toc = time.perf_counter()
print(f"run in {toc - tic:0.4f} seconds")

#+end_src

#+RESULTS:
: [10, 15, 3, 7]
: 18
: True
: run in 0.2104 seconds

*** using numpy
building blocks
#+begin_src python
import numpy as np

lst = [10, 15, 3, 7]
k = 18
o = np.array(lst)
ox1, ox2 = np.ix_(o,o)
print(ox1)
print(ox2)
print(ox1 + ox2)

#+end_src

#+RESULTS:
: [[10]
:  [15]
:  [ 3]
:  [ 7]]
: [[10 15  3  7]]
: [[20 25 13 17]
:  [25 30 18 22]
:  [13 18  6 10]
:  [17 22 10 14]]

another reduce
#+begin_src python
import numpy as np
def ufunc_reduce(ufct, *vectors):
    vs = np.ix_(*vectors)
    r = ufct.identity
    for v in vs:
        r = ufct(r, v)
    return r

def f(lst, k):
    o = ufunc_reduce(np.add, lst, lst)
    return((o == k).sum() > 0)

#print(ufunc_reduce(np.add, o, o))

tic = time.perf_counter()
print(f(range(1000), k))
toc = time.perf_counter()
print(f"run in {toc - tic:0.4f} seconds")

#+end_src

Numpy way is faster than nested for loops when the list is 1000 long.

** Don't calculate all sums.
Instead use a set to store the list as you iterate through (so no duplicate numbers).  For each element check if it minus any element in the set (previous elements of the list) are equal to "k".

Even when iterating through the whole list it is pretty fast.  And much faster if no need to check every element.
#+begin_src python
import time

k = 999999
def two_sum(lst, k):
    seen = set()
    for num in lst:
        if k - num in seen:
            return True
        seen.add(num)
    return False


tic = time.perf_counter()
print(two_sum(range(10000), k))
toc = time.perf_counter()
print(f"run in {toc - tic:0.4f} seconds")

#+end_src

#+RESULTS:
: False
: run in 0.0065 seconds

